README.org
* My Hammerspoon configuration
  :PROPERTIES:
  :CUSTOM_ID: my-hammerspoon-configuration
  :END:

[[http://www.hammerspoon.org/][Hammerspoon]] is one of the most-used utilities on my Mac. This repository contains my personal configuration, which you can use as a starting point and modify to suit your needs and preferences.

** How to use it
   :PROPERTIES:
   :CUSTOM_ID: how-to-use-it
   :END:

1. Install [[http://www.hammerspoon.org/][Hammerspoon]] (minimum version required: 0.9.55, which introduced the =hs.spoons= module)

2. Clone this repository into your =~/.hammerspoon= directory:
   #+BEGIN_EXAMPLE
       git clone https://github.com/zzamboni/oh-my-hammerspoon.git ~/.hammerspoon
   #+END_EXAMPLE

3. Review [[file:init.lua][init.lua]] and change or disable any Spoons as needed. Note that this file is generated from [[file:init.org][init.org]], where you can read also a full description of the code. If you are an Emacs org-mode user, you can edit =init.org= and generate =init.lua= by tangling the file (=M-x org-babel-tangle=).

4. Run Hammerspoon.

5. All the necessary Spoons will be downloaded, installed and configured.

6. Have fun!
